# Load the Pandas libraries with alias 'pd'  and read data from file

In [0]:
import pandas as pd


# Read data from file 'filename.csv'

In [0]:
# Read data from file 'people.csv' 
# (in the same directory that your python process is based)
# Control delimiters, rows, column names with read_csv (see later) 

url = 'https://raw.githubusercontent.com/ddfir/colab_io/master/people.csv?token=ABVYEUR3URHKL3M2I7NWG2254ZWKU'
data = pd.read_csv(url)

# Preview the first 5 lines of the loaded data

In [4]:
data.head()

                    John       Doe  ...   NJ  08075
0                   Jack  McGinnis  ...   PA   9119
1          John "Da Man"    Repici  ...   NJ   8075
2                Stephen     Tyler  ...   SD  91234
3                    NaN  Blankman  ...   SD    298
4  Joan "the bone", Anne       Jet  ...   CO    123

[5 rows x 6 columns]